# 4. Използване на псевдоними (aliases):
# Задача: Импортирайте библиотеката datetime като dt и
# използвайте я, за да отпечатате текущата дата и час.

import datetime as dt

print("\nToday!\n")

today = dt.datetime.today()

print(today)